# Pandas

In [1]:
import pandas as pd

* Series-----1d array
* Data Frame ---2d array (Table format ,row&col)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,32,123,43])
c = pd.Series((23,43,23,54))
d = pd.Series({'a':10,'b':15,'c':23,'d':12})

C:\Users\91759\AppData\Local\Temp\ipykernel_21468\2590085141.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     32
3    123
4     43
dtype: int64

In [6]:
c

0    23
1    43
2    23
3    54
dtype: int64

In [7]:
d

a    10
b    15
c    23
d    12
dtype: int64

# day 9

In [8]:
import numpy as np

In [13]:
n=np.array([1,2,3,4,4])

In [15]:
x=pd.Series(n)

In [19]:
x

0    1
1    2
2    3
3    4
4    4
dtype: int32

In [18]:
type(x)

pandas.core.series.Series

In [24]:
b= pd.Series([1,2,[11.13],32,[12,132,34],123,43])

In [25]:
b

0                1
1                2
2          [11.13]
3               32
4    [12, 132, 34]
5              123
6               43
dtype: object

In [31]:
b[2][0]

11.13

In [32]:
b[2]

[11.13]

In [33]:
b[3:7]

3               32
4    [12, 132, 34]
5              123
6               43
dtype: object

In [34]:
d

a    10
b    15
c    23
d    12
dtype: int64

In [36]:
d[3]

12

In [37]:
d['d']

12

In [38]:
d['b':'d']

b    15
c    23
d    12
dtype: int64

In [39]:
s=pd.Series([12,23,42,54,34],index=['k','l','m','n','p'])

In [40]:
s

k    12
l    23
m    42
n    54
p    34
dtype: int64

In [54]:
s1=pd.Series([12,23,42,54,34],index=list('klmnp'))

In [55]:
s1

k    12
l    23
m    42
n    54
p    34
dtype: int64

In [44]:
s2=pd.Series([12,23,42,54,34,42,12,23,2,2])

In [45]:
s2

0    12
1    23
2    42
3    54
4    34
5    42
6    12
7    23
8     2
9     2
dtype: int64

s2.value_counts()

In [48]:
s2.argmax()

3

In [49]:
s2.argmin()

8

In [58]:
s1.idxmax()

'n'

In [59]:
s1.idxmin()

'k'

# DataFrame

In [63]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,32,43,23])

In [64]:
a

Empty DataFrame
Columns: []
Index: []

In [65]:
b

    0
0   1
1   2
2  32
3  43
4  23

In [66]:
type(b)

pandas.core.frame.DataFrame

In [67]:
c=pd.DataFrame([ [2,3,5]    ,[3,4,5]     ,[23,45,345]])

In [68]:
c

    0   1    2
0   2   3    5
1   3   4    5
2  23  45  345

In [77]:
d=pd.DataFrame([ [2,3,5] ,[23,1,23] ,[3,5,2]  ,[3,4,4]     ,[23,45,34],[12,23,34],[3,4,1]])

In [78]:
d

    0   1   2
0   2   3   5
1  23   1  23
2   3   5   2
3   3   4   4
4  23  45  34
5  12  23  34
6   3   4   1

In [74]:
d[0][2]

45

In [79]:
d.head()

    0   1   2
0   2   3   5
1  23   1  23
2   3   5   2
3   3   4   4
4  23  45  34

In [80]:
d.tail()

    0   1   2
2   3   5   2
3   3   4   4
4  23  45  34
5  12  23  34
6   3   4   1

In [81]:
d.head(2)

    0  1   2
0   2  3   5
1  23  1  23

In [82]:
d.tail(3)

    0   1   2
4  23  45  34
5  12  23  34
6   3   4   1

In [88]:
d.sample(4)

    0   1   2
4  23  45  34
2   3   5   2
6   3   4   1
5  12  23  34

In [100]:
d1=pd.DataFrame([ [2,3] ,[np.nan,1,'Missing'] ,[3,5]  ,[3,4,4]     ,[23, np.nan,34],[12,24],[3,1]])

In [101]:
d1

      0     1        2
0   2.0   3.0     None
1   NaN   1.0  Missing
2   3.0   5.0     None
3   3.0   4.0        4
4  23.0   NaN       34
5  12.0  24.0     None
6   3.0   1.0     None

In [107]:
d1=pd.DataFrame([ [2,3] ,[np.nan,1,'Missing'] ,[3,5]  ,[3,4,4]     ,[23, np.nan,34],[12,24],[3,1]],index=list('kashika'),columns=['colA','colB','colC'])

In [108]:
d1

   colA  colB     colC
k   2.0   3.0     None
a   NaN   1.0  Missing
s   3.0   5.0     None
h   3.0   4.0        4
i  23.0   NaN       34
k  12.0  24.0     None
a   3.0   1.0     None

In [112]:
d1['colB']

k     3.0
a     1.0
s     5.0
h     4.0
i     NaN
k    24.0
a     1.0
Name: colB, dtype: float64

In [113]:
d1['colB']['h']

4.0

In [119]:
d1[['colB','colA']]

   colB  colA
k   3.0   2.0
a   1.0   NaN
s   5.0   3.0
h   4.0   3.0
i   NaN  23.0
k  24.0  12.0
a   1.0   3.0

In [131]:
d1[['colB','colC']].head(3)

   colB     colC
k   3.0     None
a   1.0  Missing
s   5.0     None

In [132]:
d1[['colB','colC']][1:4]

   colB     colC
a   1.0  Missing
s   5.0     None
h   4.0        4

In [133]:
d1.shape

(7, 3)

In [139]:
d1['colA'].max()

23.0

In [143]:
d1['colB'].min()

1.0

In [144]:
d1['new_col']=[12,32,13,43,23,23,34]

In [145]:
d1

   colA  colB     colC  new_col
k   2.0   3.0     None       12
a   NaN   1.0  Missing       32
s   3.0   5.0     None       13
h   3.0   4.0        4       43
i  23.0   NaN       34       23
k  12.0  24.0     None       23
a   3.0   1.0     None       34

In [147]:
d1['new_col'].min()

12

In [148]:
# none is string so c can't give min

k     5.0
a     NaN
s     8.0
h     7.0
i     NaN
k    36.0
a     4.0
dtype: float64

In [160]:
d1=pd.DataFrame([ [2,3] ,[np.nan,1,'Missing'] ,[3,5]  ,[3,4,4]     ,[23, np.nan,34],[12,24],[3,1]],index=list('kashika'),columns=['colA','colB','colC'])

In [161]:
d1

   colA  colB     colC
k   2.0   3.0     None
a   NaN   1.0  Missing
s   3.0   5.0     None
h   3.0   4.0        4
i  23.0   NaN       34
k  12.0  24.0     None
a   3.0   1.0     None

In [164]:
d1['new_col1']=[12,32,13,43,23,23,34]
d1['new_col2']=[1,3,1,4,3,3,4]

In [165]:
d1

   colA  colB     colC  new_col  new_col1  new_col2
k   2.0   3.0     None        1        12         1
a   NaN   1.0  Missing        3        32         3
s   3.0   5.0     None        1        13         1
h   3.0   4.0        4        4        43         4
i  23.0   NaN       34        3        23         3
k  12.0  24.0     None        3        23         3
a   3.0   1.0     None        4        34         4

In [166]:
d1['colD']=d1['new_col']+d1['new_col1']+d1['new_col2']

In [167]:
d1

   colA  colB     colC  new_col  new_col1  new_col2  colD
k   2.0   3.0     None        1        12         1    14
a   NaN   1.0  Missing        3        32         3    38
s   3.0   5.0     None        1        13         1    15
h   3.0   4.0        4        4        43         4    51
i  23.0   NaN       34        3        23         3    29
k  12.0  24.0     None        3        23         3    29
a   3.0   1.0     None        4        34         4    42

In [168]:
d1['colD']>50

k    False
a    False
s    False
h     True
i    False
k    False
a    False
Name: colD, dtype: bool

In [178]:
f=d1['colD']>30

In [179]:
d1[f]

   colA  colB     colC  new_col  new_col1  new_col2  colD
a   NaN   1.0  Missing        3        32         3    38
h   3.0   4.0        4        4        43         4    51
a   3.0   1.0     None        4        34         4    42